{
  "meetUps": [
    {
      "id": 1,
      "isActive": false,
      "title": "Let’s chat? Realtime updates",
      "description": "Весна завжди надихає нас на комунікації, тож ми запрошуємо cтудентів на зустріч, що буде присвячена віртуальному спілкуванню :).Андрій – студент другого курсу, і він сидить на форумі. Сайт форуму запустили 2007-го року на phpBB версії 3.0.0. Андрій читає та пише коментарі в темах. Відкривши тему, він бачить тільки повідомлення, що були залишені на той час. Нові коментарі він побачить лише після оновлення сторінки. І це його влаштовує.Та спілкування в чаті – зовсім інша річ. Андрій запросив дівчину на побачення через Messenger. Тепер він нервується ще більше кожної секунди. І так поки не отримає відповідь. Приходь на мітап “Let’s chat? Realtime updates” дізнайся про підходи, які роблять життя Андрія кращим :).",
      "dates": [],
      "image": "https://scontent.fkbp1-1.fna.fbcdn.net/v/t1.0-9/30698474_1753868844651240_3605910136827716243_n.jpg?_nc_cat=0&oh=1ab6cac864cf1fc40ee51d057cb7176f&oe=5BD173A1",
      "blogLink": "https://blog.interlink-ua.com/interlink-meetup-lets-chat-realtime-updates/",
      "users": []
    },
    {
      "id": 2,
      "isActive": false,
      "title": "Mastering HTTP & REST",
      "description": "Ми продовжуємо знайомити студентів зі світом ІТ та вже підготували наступний InterLink Meetup 'Mastering HTTP & REST' :). Ми розглянемо основні можливості HTTP протоколу та принципи побудови REST архітектури. Отриманні знання допоможуть вам у використанні наявних REST API, а також у побудові своїх власних. Окрім самих протоколів ми розглянемо декілька простих інструментів. Postman допоможе поекспериментувати з API та ознайомитись з його можливостями. Для опису документації та швидких прикладів використання стане у пригоді curl. А json-server допоможе швидко і просто створити фейковий RESTful сервіс з набором базових CRUD операцій.У фінальній частині зустрічі на вас чекає практичне заняття. Всі разом ми ще раз пригадаємо, що HTTP - це протокол текстовий, та закріпимо основні положення про REST. ",
      "dates": [],
      "image": "https://scontent.fkbp1-1.fna.fbcdn.net/v/t1.0-9/27332361_1678105548894237_297885041292397331_n.jpg?_nc_cat=0&oh=bb2483531a26467628531cbdb2a4e808&oe=5BE633C2",
      "blogLink": "https://blog.interlink-ua.com/interlink-meetup-mastering-http-rest/",
      "users": []
    },
    {
      "id": 3,
      "isActive": false,
      "title": "Functional Programming",
      "description": "Всі ми добре знайомі з ООП та його принципами, які вже стали парадигмою де-факто для рішення більшості задач. Проте необхідність розробки складних frontend додатків та обробки величезної кількості запитів та обсягів даних на backend підігрівають інтерес до альтернативних підходів та нових мов програмування. На наступному InterLink Meetup ви познайомитесь з принципами ФП та як їх використання в JavaScript та Java може спростити створення звичних вам програм та відкрити двері до вирішення складніших задач.",
      "dates": [],
      "image": "https://scontent.fkbp1-1.fna.fbcdn.net/v/t31.0-8/23331326_1595539030484223_2928806695751218259_o.jpg?_nc_cat=0&oh=e1bc5d249a81bbd60d88aebb7652742b&oe=5BCC4DCD",
      "blogLink": "https://blog.interlink-ua.com/interlink-meetup-functional-programming/",
      "users": []
    },
    {
      "id": 4,
      "isActive": false,
      "title": "InterLink Meetup: Forming async mindset",
      "description": "Продовжуємо проводити літо фаново та з користю :), тому запрошуємо на черговий літній InterLink Meetup 10 та 12 липня! Розробка сучасних веб додатків не можлива без розуміння асинхронності. Разом з нами ви зрозумієте концепцію асинхронного виконання коду. Ми розглянемо які в браузері існують джерела асинхронних подій та познайомимось, як браузер працює з чергою обробників подій. Розберемося, що таке callback та promise. Розуміння асинхронності в браузері забезпечить вам необхідний фундамент для створення власних веб додатків.А якщо ви вже в темі, все одно приходьте – пофанимось разом ;).Мітап триватиме два дні: 10 та 12 липня, тож на тебе очікує fun та code.Реєструйся на один або на обидва дні івенту, залежно від своїх вподобань та не забудь прихопити друга :)",
      "dates": [],
      "image": "https://scontent.fkbp1-1.fna.fbcdn.net/v/t1.0-9/36598400_1844361065602017_3021911377120854016_o.jpg?_nc_cat=0&oh=8deb270ff95a2a42bb0339cdcc97a1ee&oe=5BDC9CA4",
      "blogLink": "",
      "users": []
    },
    {
      "id": 5,
      "isActive": true,
      "title": "Realtime apps without backend code",
      "description": "Бували на хакатонах? А чи ловили себе на думці, що наче і зробили багато, а у фіналі й показати нічого? Це наслідок концентрації на другорядних задачах замість першочергових.Цього разу ми розглянемо один із засобів, як за меншу кількість часу досягти кращих результатів. Ми навчимось використовувати готові сервіси замість створення власного бекенду – Backend as a Serivce.Особливо цікаво спостерігати за додатками, які вміють синхронізувати дані між декількома користувачами. Такими додатками можуть бути різні онлайн ігри або чати. На мітапі ми розглянемо роботу з сервісом Firebase. Адже саме він надає можливість обміну даними в режимі реального часу. З його допомогою ви зможете побудувати просту онлайн-гру, чат, чи інший цікавий додаток без жодного рядку коду на backend`і. І тим паче він стане у пригоді майбутнім розробникам мобільних додатків ;).",
      "dates": [],
      "image": "https://scontent.fkbp1-1.fna.fbcdn.net/v/t1.0-9/37238870_1864368406934616_404057333363113984_o.jpg?_nc_cat=0&oh=214e00b4e281d45d6d82a2a7faa168fd&oe=5BEC5859",
      "blogLink": "",
      "users": []
    }
  ],
  "users": [
    {
      "id": 1,
      "login": "admin",
      "pass": "1234",
      "type": "admin"
    },
    {
      "id": 2,
      "login": "vanyalolo",
      "pass": "5645676575675675",
      "type": "client",
      "avatarImage": "C:\\fakepath\\ivan_brackenbury.jpg",
      "name": "Іван",
      "secondName": "Прокопенко",
      "phone": "0671234567",
      "email": "renkonazbka@gmail.com",
      "social": "https://www.facebook.com/",
      "birth": "1999-06-01",
      "university": "Черкаський Національний університет ім.Б. Хмельницького",
      "faculty": "Факультет інформаційних технологій і систем",
      "course": 4,
      "hasLaptop": false
    }
  ]
}